// Задача 49: Задайте двумерный массив. Найдите элементы, у
// которых оба индекса чётные, и замените эти элементы на их
// квадраты.


int[,] CreateMatrixRndInt(int rows, int colums, int min, int max) // создаём метод где используем расчёт двумерного массива с случайными числами
{
    Random rnd = new Random();
    int[,] matrix = new int[rows, colums];
    for (int i = 0; i < matrix.GetLength(0); i++) // строки
    {
        for (int j = 0; j < matrix.GetLength(1); j++) // столбцы
        {
            matrix[i, j] = rnd.Next(min, max + 1);
        }

    }
    return matrix;
}

void PrintMatrix(int[,] matrix)// создаём метод с выводом прошлого метода
{
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        Console.Write("|");
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            if (j < matrix.GetLength(1) - 1) Console.Write($"{matrix[i,j], 5}   |");
            else Console.Write($"{matrix[i,j], 5} ");
        }
        Console.WriteLine("  |");
    }
}

int[,] HonestlementsMatrix(int[,] matrix)
{
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            if(i%2 == 0 && j%2 ==0)
            {
            matrix[i,j] *=  matrix[i,j];
            }
        }
    }
    return matrix;
}

int[,] mat = CreateMatrixRndInt(3, 4, 0, 10); // создаём переменную для запроса метода
PrintMatrix(mat); // печатаем метод
Console.WriteLine();
HonestlementsMatrix(mat);
PrintMatrix(mat);